Table of Contents
 Interface ICadModel
Namespace
IdeaStatiCa.BimApiLink.Plugin
Assembly
IdeaStatiCa.BimApiLink.dll
public interface ICadModel : IModel
Inherited Members
 IModel.GetAllMembers()
 IModel.GetOriginSettings()
Methods
 GetSelectionOfWholeModel()
Get selection represent bulk selection of all entities in model
IEnumerable<CadUserSelection> GetSelectionOfWholeModel()
Returns
IEnumerable<CadUserSelection>
 GetUserSelection()
Get selection represent single connection
CadUserSelection GetUserSelection()
Returns
CadUserSelection
 GetUserSelections()
Get bulk selection represent multiple connections
IEnumerable<CadUserSelection> GetUserSelections()
Returns
IEnumerable<CadUserSelection>
 Edit this page